УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/CommonModules/CRM_СоисполнителиДиалоговКлиент/Module.bsl
#Область ПрограммныйИнтерфейс

// ДанныеКонтакта: УчетнаяЗапись, Группа, ID_Пользователя
//
// Параметры:
//  Пользователь				 - СправочникСсылка.Пользователи	 - Пользователь.
//  ДанныеКонтакта				 - Структура						 - Данные контакта.
//  РанееВыбранныеПользователи	 - СправочникСсылка.Пользователи	 - Польлзователь, который был выбран ранее.
//  ОповещениеОЗавершении		 - ОписаниеОповещения				 - Оповещение о завершении.
//
Процедура ДобавитьСоисполнителя(Пользователь, ДанныеКонтакта, РанееВыбранныеПользователи, ОповещениеОЗавершении) Экспорт
	
	ПользовательЯвляетсяОтветственным = CRM_СоисполнителиДиалоговСервер.ПользовательЯвляетсяОтветственным(
		Пользователь, ДанныеКонтакта.ТекущийДиалог, ДанныеКонтакта.УчетнаяЗапись);
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ПользовательЯвляетсяОтветственным", ПользовательЯвляетсяОтветственным);
	ДополнительныеПараметры.Вставить("ДанныеКонтакта", ДанныеКонтакта);
	ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьСоисполнителяПользовательВыбран",
		 ЭтотОбъект,
		 ДополнительныеПараметры);
	
	РанееВыбранныеПользователи.Добавить(Пользователь);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыФормы.Вставить("СкрываемыеПользователи", РанееВыбранныеПользователи);
	
	ОткрытьФорму("Справочник.Пользователи.ФормаВыбора", ПараметрыФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

// Процедура-обработчик выбора пользователя при добавлении соисполнителя.
//
// Параметры:
//  Результат				 - Массив, СправочникСсылка.Пользователи	 - Выбранные пользователи.
//  ДополнительныеПараметры	 - Структура	 - Дополнительные параметры.
//
Процедура ДобавитьСоисполнителяПользовательВыбран(Результат, ДополнительныеПараметры) Экспорт
	
	ВыбранныеПользователи = Результат;
	
	Если ВыбранныеПользователи = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранныеПользователи) = Тип("СправочникСсылка.Пользователи") Тогда
		ВыбранныйПользователь = ВыбранныеПользователи;
		ВыбранныеПользователи = Новый Массив;
		ВыбранныеПользователи.Добавить(ВыбранныйПользователь);
	КонецЕсли;
	
	ДанныеКонтакта = ДополнительныеПараметры.ДанныеКонтакта;
	ПользовательЯвляетсяОтветственным = ДополнительныеПараметры.ПользовательЯвляетсяОтветственным;
	ОповещениеОЗавершении = ДополнительныеПараметры.ОповещениеОЗавершении;
	
	ДоступПользователей = CRM_СоисполнителиДиалоговСервер.ДоступПользователей(ВыбранныеПользователи,
		 ДанныеКонтакта.УчетнаяЗапись);
	
	ПользователиСДоступом = ДоступПользователей.ПользователиСДоступом;
	ПользователиБезДоступа = ДоступПользователей.ПользователиБезДоступа;
	
	Если ПользовательЯвляетсяОтветственным И ПользователиБезДоступа.Количество() > 0 Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("ДанныеКонтакта", ДанныеКонтакта);
		ДополнительныеПараметры.Вставить("ВыбранныеПользователи", ВыбранныеПользователи);
		ДополнительныеПараметры.Вставить("ПользователиСДоступом", ПользователиСДоступом);
		ДополнительныеПараметры.Вставить("ПользователиБезДоступа", ПользователиБезДоступа);
		ДополнительныеПараметры.Вставить("ОповещениеОЗавершении", ОповещениеОЗавершении);
		
		Оповещение = Новый ОписаниеОповещения("ДатьДоступКУчетнойЗаписиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Добавить в доступ к учетной записи?'"),
			 РежимДиалогаВопрос.ДаНетОтмена, 60,
			 КодВозвратаДиалога.Отмена);
		Возврат;
		
	КонецЕсли;
	
	CRM_СоисполнителиДиалоговСервер.ДобавитьСоисполнителя(ПользователиСДоступом, ДанныеКонтакта);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	
КонецПроцедуры

// Процедура-обработчик завершения предоставления доступа к учетной записи.
//
// Параметры:
//  Результат				 - КодВозвратаДиалога	 - Код возврата диалога.
//  ДополнительныеПараметры	 - Структура	 - Дополнительные параметры.
//
Процедура ДатьДоступКУчетнойЗаписиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		CRM_СоисполнителиДиалоговСервер.ДобавитьСоисполнителя(ДополнительныеПараметры.ПользователиСДоступом,
			 ДополнительныеПараметры.ДанныеКонтакта);
	Иначе 
		МассивНачальноеСостояниеДоступа = Новый Массив;
		CRM_СоисполнителиДиалоговСервер.ДобавитьПользователяВУчетнуюЗаписьМессенджера(ДополнительныеПараметры.ПользователиБезДоступа,
																							ДополнительныеПараметры.ДанныеКонтакта.УчетнаяЗапись, МассивНачальноеСостояниеДоступа);
		CRM_СоисполнителиДиалоговСервер.ДобавитьСоисполнителя(ДополнительныеПараметры.ВыбранныеПользователи,
			 ДополнительныеПараметры.ДанныеКонтакта,
			 МассивНачальноеСостояниеДоступа);
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОповещениеОЗавершении);
	
КонецПроцедуры

// ДанныеКонтакта: УчетнаяЗапись, Группа, ID_Пользователя
//
// Параметры:
//  ДанныеКонтакта			 - Структура			 - Данные контакта.
//  УдаляемыеСоисполнители	 - Массив				 - Массив удаляемых соисполнителей.
//  ОповещениеОЗавершении	 - ОписаниеОповещения	 - Оповщение о завершении.
//
Процедура УдалитьСоисполнителя(ДанныеКонтакта, УдаляемыеСоисполнители, ОповещениеОЗавершении) Экспорт
	
	CRM_СоисполнителиДиалоговСервер.УдалитьСоисполнителя(УдаляемыеСоисполнители, ДанныеКонтакта);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	
КонецПроцедуры

// ДанныеКонтакта: УчетнаяЗапись, Группа, ID_Пользователя
//
// Параметры:
//  ДанныеКонтакта			 - Структура			 - Данные контакта.
//  ОповещениеОЗавершении	 - ОписаниеОповещения	 - Оповщение о завершении.
//
Процедура УдалитьВсехСоисполнителей(ДанныеКонтакта, ОповещениеОЗавершении) Экспорт
	
	CRM_СоисполнителиДиалоговСервер.УдалитьВсехСоисполнителей(ДанныеКонтакта);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении);
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" для поля значения соисполнителя в форме объекта.
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения	 - Форма объекта
//  Элемент	             - ЭлементыФормы - Декорация с именем исполнителя
//
Процедура СоисполнительНажатиеИмя(Форма, Элемент) Экспорт
	
	СоисполнительИД = СтрЗаменить(Сред(Элемент.Имя, 17), "_", "-");
	
	НайденныеСтроки = Форма.СоисполнителиТЗ.НайтиСтроки(Новый Структура("ИдентификаторЭлемента", СоисполнительИД));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(, НайденныеСтроки[0].Значение);
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" для поля значения соисполнителя в форме объекта.
//
// Параметры:
//  Форма				 - ФормаКлиентскогоПриложения	 - Форма объекта
//  Элемент	             - ЭлементыФормы - Декорация с именем исполнителя
//  ДанныеТекущегоКонтакта - Структура - Данные текущего контакта
//
Процедура СоисполнительНажатиеКнопка(Форма, Элемент, ДанныеТекущегоКонтакта) Экспорт
	
	СоисполнительИД = СтрЗаменить(Сред(Элемент.Имя, 23), "_", "-");
	
	НайденныеСтроки = Форма.СоисполнителиТЗ.НайтиСтроки(Новый Структура("ИдентификаторЭлемента", СоисполнительИД));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УдаляемыеСоисполнители = Новый Массив;
	УдаляемыеСоисполнители.Добавить(НайденныеСтроки[0].Значение);
	
	УдалитьСоисполнителя(ДанныеТекущегоКонтакта,
							УдаляемыеСоисполнители,
							Новый ОписаниеОповещения("ЗаполнитьСписокСоисполнителейОповещение", Форма));
	
КонецПроцедуры

// Определяет, является ли пользователь соисполнителем по контакту.
//
// Параметры:
//  ДанныеКонтакта	 - Структура				 - Данные контакта.
//  Пользователь	 - СправочникСсылка.Пользователи - Пользователь.
// 
// Возвращаемое значение:
//  Булево - Истина, если пользователь является соисполнителем.
//
Функция ПользовательЯвляетсяСоисполнителем(ДанныеКонтакта, Пользователь) Экспорт
	
	Возврат CRM_СоисполнителиДиалоговСервер.ПользовательЯвляетсяСоисполнителем(ДанныеКонтакта, Пользователь);
	
КонецФункции

#КонецОбласти
